app/controllers/admins_controller.rb

  def create
    @admin = Admin.new(admin_params)

    respond_to do |format|
      if @admin.save
---
INSERT INTO "admins" ("username", "password", "name", "secuirity_question", "secuirity_answer", "email", "phone", "level", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)