app/controllers/banks_controller.rb

  def index
    @banks = Bank.all
---
SELECT "banks".* FROM "banks"