app/controllers/citizen_controller.rb

SELECT "citizens".* FROM "citizens"
---
    def index
       @citizens = Citizen.all

SELECT "citizens".* FROM "citizens"
---
	def list
		@citizens = Citizen.all

SELECT  "citizens".* FROM "citizens" WHERE "citizens"."id" = ? LIMIT 1  [["id", 0]]
---
	def show
		@citizen = Citizen.find(params[:id])

INSERT INTO "citizens" ("name") VALUES (?)  [["name", "edmond"]]
---
	def create
		@citizens = Citizen.new(citizen_params)

		if @citizens.save