app/controllers/transactions_controller.rb

  def index
    @transactions = Transaction.all
---
SELECT "transactions".* FROM "transactions"  ORDER BY created_at DESC

  def create
      @transaction = Transaction.new(transaction_params)
      @account= Account.find_by_id(params[:account_id])
      @bank= Bank.find_by_id(Account.bank_id)
      @signin_data = OpenStruct.new( :admin => @admin , :dashboard => @dashboard , :transactions => @transactions , :token => "123456" , :status => 200 , :message => "successful")
      @signin_error =OpenStruct.new(:status => 401 , :message => "Access Denied" )

    respond_to do |format|
      if @transaction.save
---
INSERT INTO "transactions" ("transaction_type", "amount", "transaction_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["transaction_type", "debit"], ["amount", 500], ["transaction_date", "2015-05-11"], ["created_at", "2015-11-16 11:17:49.265155"], ["updated_at", "2015-11-16 11:17:49.265155"]]

  def destroy
    @transaction.destroy
---
DELETE FROM "transactions" WHERE "transactions"."id" = ?  [["id", 1]]